import 'package:kozarni_ecome/model/division.dart';
import 'package:kozarni_ecome/model/township.dart';

final List<Township> townshipList = [
  Township(name: "ကျောက်တံတား", fee: 1500),
  Township(name: "ပန်းဘဲတန်း", fee: 1500),
  Township(name: "လမ်းမတော်", fee: 1500),
  Township(name: "လသာ", fee: 1500),
  Township(name: "ဗိုလ်တစ်ထောင်", fee: 1500),
  Township(name: "ပုဇွန်တောင်", fee: 1500),
  Township(name: "မင်္ဂလာတောင်ညွှန့်", fee: 1500),
  Township(name: "အခြား ရန်ကုန်မြို့တွင်း", fee: 2000),
  Township(name: "နယ်ဝေး", fee: 3000),
];

final List<Division> divisionList = [
  //Yangon Division
  Division(
    name: "ရန်ကုန်တိုင်း",
    townShipMap: {
      '1500': [
        "ကျောက်တံတား  ၁၅၀၀",
        "ပန်းဘဲတန်း  ၁၅၀၀",
        "လမ်းမတော်  ၁၅၀၀",
        "လသာ  ၁၅၀၀",
        "ဗိုလ်တထောင်  ၁၅၀၀",
        "ပုဇွန်တောင်  ၁၅၀၀",
        "မင်္ဂလာတောင်ညွန့်  ၁၅၀၀",
      ],

      '2000': [
        "အလုံ  ၂၀၀၀",
        "ဗဟန်း  ၂၀၀၀",
        "ဒဂုံ  ၂၀၀၀",
        "ဒဂုံမြို့သစ် တောင်ပိုင်း ၂၀၀၀",
        "ဒဂုံမြို့သစ် မြောက်ပိုင်း ၂၀၀၀",
        "ဒဂုံမြို့သစ် အရှေ့ပိုင်း ၂၀၀၀",
        "ဒဂုံမြို့သစ် ဆိပ်ကမ်း ၂၀၀၀",
        "လှိုင်သာယာ  ၂၀၀၀",
        "အင်းစိန်  ၂၀၀၀",
        "ကမာရွတ်  ၂၀၀၀",
        "မင်္ဂလာဒုံ  ၂၀၀၀",
        "မြောက်ဥက္ကလာပ  ၂၀၀၀",
        "တောင်ဥက္ကလာပ  ၂၀၀၀",
        "ရွှေပြည်သာ  ၂၀၀၀",
        "တာမွေ  ၂၀၀၀",
        "မရမ်းကုန်း  ၂၀၀၀",
        "ကြည့်မြင်တိုင်  ၂၀၀၀",
        "လှိုင်  ၂၀၀၀",
        "သန်လျှင်  ၂၀၀၀",
        "စမ်းချောင်း  ၂၀၀၀",
        "သင်္ယန်းကျွန်း  ၂၀၀၀",
        "သာကေတ  ၂၀၀၀",
        "ဒေါပုံ  ၂၀၀၀",
        "ရန်ကင်း  ၂၀၀၀",
      ]
    },
  ),




  Division(
    name: "နယ်ဝေး",
    townShipMap: {
      "3000": [
        "ထောက်ကြန့်  ၃၀၀၀",
        "လှည်းကူး  ၃၀၀၀",
        "မှော်ဘီ  ၃၀၀၀",
        "တိုက်ကြီးမြို့  ၃၀၀၀",
        "ကျောက်တန်းမြို့  ၃၀၀၀",
        "ခရမ်းမြို့  ၃၀၀၀",
        "သုံးခွမြို့  ၃၀၀၀",
        "တွံတေးမြို့  ၃၀၀၀",
        "ဒလမြို့  ၃၀၀၀",
        "နေပြည်တော်မြို့  ၃၀၀၀",
        "မန္တလေးမြို့  ၃၀၀၀",
        "ပဲခူးမြို့  ၃၀၀၀",
        "မော်လမြိုင်မြို့  ၃၀၀၀",
        "ပုသိမ်မြို့  ၃၀၀၀",
      ],
    },
  ),
];
